app/controllers/cities_controller.rb

INSERT INTO "cities" ("name", "code", "created_at", "updated_at", "country_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "qutaisi"], ["code", "2"], ["created_at", 2017-04-22 19:19:20 UTC], ["updated_at", 2017-04-22 19:19:20 UTC], ["country_id", 2]]
---
  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save