app/controllers/schools_controller.rb

  def show
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @school = School.new(school_params)

    if @school.save
---
INSERT INTO "schools" ("name", "address", "student_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dasds"], ["address", "dssa"], ["student_amount", 12], ["created_at", 2017-04-21 03:13:30 UTC], ["updated_at", 2017-04-21 03:13:30 UTC]]

  def update
    @school = School.find(params[:id])

    if @school.update(school_params)
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "schools" SET "student_amount" = $1, "updated_at" = $2 WHERE "schools"."id" = $3  [["student_amount", 151], ["updated_at", 2017-04-21 04:04:11 UTC], ["id", 9]]

  def destroy
    @school = School.find(params[:id])

    @school.destroy
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 1]]