app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("name", "last_name", "person_id", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dsads"], ["last_name", "dssads"], ["person_id", 0], ["birth_date", Fri, 21 Apr 2017], ["created_at", 2017-04-21 03:44:30 UTC], ["updated_at", 2017-04-21 03:44:30 UTC]]

  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "person_id" = $1, "birth_date" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["person_id", 3], ["birth_date", Sat, 21 Apr 1984], ["updated_at", 2017-04-21 03:58:14 UTC], ["id", 10]]