app/views/cities/_form.html.erb

SELECT "countries".* FROM "countries"
---
      <%= f.label :country %>
      <%= f.collection_select :country_id, Country.all, :id, :name %>